Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiClientSecure.h>
#include <WiFiClientSecureBearSSL.h>

#include <FirebaseESP8266.h>
#include <OneWire.h>
#include <WiFiUdp.h>
#include <memory>
#include "DS3231.h"  //Время
#include "GBasic.h"
#include "RtcDS3231.h"
#include "Shiftduino.h"
#include "TimeAlarms.h"
#include "uEEPROMLib.h"
#include "uptime_formatter.h"

// Shift register pinout
#define dataPin 10
#define clockPin 14
#define latchPin 16
#define numOfRegisters 4
#define indexRegisterRelay 4
Shiftduino shiftRegister(dataPin, clockPin, latchPin, numOfRegisters);

std::unique_ptr<GBasic> doserK{};
std::unique_ptr<GBasic> doserNP{};
std::unique_ptr<GBasic> doserFe{};

#define FIREBASE_HOST "aqua-3006a.firebaseio.com"
#define FIREBASE_AUTH "eRxKqsNsandXnfrDtd3wjGMHMc05nUeo5yeKmuni"
#define FIREBASE_FCM_SERVER_KEY                                                                             \
    "AAAAXMB0htY:APA91bHWX0TsxqBxol0i-1eSJKn0y6e9TpxAfwmyVO6x7BWfwrU0Bmpp_BNun1x6RWLo8lDa98A0WXfKoxzCBhoC_" \
    "SzDdzk1ZiizAWQceyClzHC79_Rw9u_9t85p6jHTRGc5qD4WpMwd"
#define FIREBASE_FCM_DEVICE_TOKEN                                                                                                  \
    "f9LZ68h4adI:"                                                                                                                 \
    "APA91bHDpiNHPCytTH6sQBLV7s97VwWTVKPrZN8P7nsLn73MbNIZxPnZRxn5ot6UlywQl7uNi5NhNtSdnrficBXabuPSdbgAIcEJH6oFRElckf9h3kE9p6H0OVR7" \
    "IJBLcPAlZFPEO2bz"

#define WORK_DEF

#ifdef WORK_DEF1
#define WIFI_SSID "Wi-Fi"
#define WIFI_PASSWORD "1234567890"
#define WIFI_RETRY 50
#else
#define WIFI_SSID "MikroTik"
#define WIFI_PASSWORD "11111111"
#define WIFI_RETRY 10
#endif

#define ONE_WIRE_BUS 14  //Пин, к которому подключены датчики DS18B20 D5 GPIO14
//#define ALARMS_COUNT 6  //Количество таймеров, которые нужно удалять. Помимо их есть еще два основных - каждую минуту и каждые
//пять. Указанное кол-во надо увеличить в случае появления нового расписания для нового устройства, например, дозаторы, CO2,
//нагреватель и прочие устройства которые будут запланированы на включение или выключение
//----------------------------------------------------------------------------------
uint8_t wifiMaxTry = WIFI_RETRY;  //Попытки подключения к сети
uint8_t wifiConnectCount = 0;

// uEEPROMLib eeprom;
uEEPROMLib eeprom(0x57);
unsigned int pos;
const uint16_t StartAddress = 16;

DS3231 clockRTC;
RtcDS3231 rtc;
bool shouldUpdateFlag = false;
std::vector<ledState_t> vectorState;
const char* WiFi_hostname = "ESP8266";
IPAddress timeServerIP;
const char* ntpServerName = "pool.ntp.org";
const int NTP_PACKET_SIZE = 48;

const long timeZoneOffset = 10800;
byte packetBuffer[NTP_PACKET_SIZE];
boolean update_status = false;
byte count_sync = 0;
byte hour1 = 0;
unsigned long hour_sync = 0;
byte minute1 = 0;
unsigned long minute_sync = 0;
byte second1 = 0;

WiFiUDP udp;
std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
HTTPClient https;
FirebaseData data;
unsigned long currentMillis = 1UL;
unsigned long previousMillis = 1UL;

String pathLight = "Light/";
String pathTemperatureOnline = "Temperature/Online/";
String pathTemperatureHistory = "Temperature/History/";
String pathDoser = "Doser/";
String pathAir = "Air";
String pathUpdateSettings = "UpdateSettings";
String pathToLastOnline = "LastOnline";
String pathToUptime = "Uptime";
String pathToBootHistory = "BootHistory";

const String urlLights =
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/"
    "Light?property=enabled&property=name&property=off&property=on&property=pin&property=state&where=name='";

OneWire ds(ONE_WIRE_BUS);
byte sensorData[12];
float temp1, temp2;

byte addr1[8] = {0x28, 0xFF, 0x17, 0xF0, 0x8B, 0x16, 0x03, 0x13};  //адрес датчика DS18B20
byte addr2[8] = {0x28, 0xFF, 0x5F, 0x1E, 0x8C, 0x16, 0x03, 0xE2};  //адрес датчика DS18B20

typedef Iterator<ledPosition, ledPosition::ONE, ledPosition::SIX> ledPositionIterator;
typedef Iterator<doserType, doserType::K, doserType::Fe> doserTypeIterator;

ledDescription_t leds[6];
doser_t dosers[3];
ledDescription_t air;
std::vector<String> splitVector(const String& msg, const char delim) {
    std::vector<String> subStrings;
    uint32_t j = 0;
    for (uint32_t i = 0; i < msg.length(); i++) {
        if (msg.charAt(i) == delim) {
            subStrings.push_back(msg.substring(j, i));
            j = i + 1;
        }
    }
    subStrings.push_back(msg.substring(j, msg.length()));
    return subStrings;
}

void checkUpdateSettings();
void _delPtr(char* p) {
    if (p != nullptr)
        delete[] p;
}

char* _newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* _newPtr(char* p, size_t len) {
    _delPtr(p);
    p = _newPtr(len);
    return p;
}

char* _newPtr(char* p, size_t len, char* d) {
    _delPtr(p);
    p = _newPtr(len);
    strcpy(p, d);
    return p;
}
char* _getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = _newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

float DS18B20(const byte* adres) {
    unsigned int raw;
    ds.reset();
    ds.select(adres);
    ds.write(0x44, 1);
    ds.reset();
    ds.select(adres);
    ds.write(0xBE);
    for (byte i = 0; i < 9; i++) {
        sensorData[i] = ds.read();
    }
    raw = (sensorData[1] << 8) | sensorData[0];
    float celsius = (float)raw / 16.0;
    return celsius;
}

void initDosers() {
    dosers[0].name = "K";
    dosers[0].type = K;
    dosers[1].name = "NP";
    dosers[1].type = NP;
    dosers[2].name = "Fe";
    dosers[2].type = Fe;
}

void initLeds() {
    leds[0].name = "One";
    leds[0].position = ONE;
    leds[1].name = "Two";
    leds[1].position = TWO;
    leds[2].name = "Three";
    leds[2].position = THREE;
    leds[3].name = "Four";
    leds[3].position = FOUR;
    leds[4].name = "Five";
    leds[4].position = FIVE;
    leds[5].name = "Six";
    leds[5].position = SIX;
}

