Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void initAir() {
    air.name = "Аэратор";
}

void getTemperature() {
    temp1 = DS18B20(addr1);
    temp2 = DS18B20(addr2);
    Serial.printf_P(PSTR(" [T1: %s°]  [T2: %s°]\n"), String(temp1).c_str(), String(temp2).c_str());
}

void sendMessage() {
    /*char* p = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    data.fcm.setNotifyMessage("Перезагрузка", String(p));
    free(p);
    if (Firebase.broadcastMessage(data)) {
        Serial.printf_P(PSTR("Сообщение отправлено\n"));
    } else {
        Serial.printf_P(PSTR("Ошибка отправки сообщения: %s\n"), data.errorReason().c_str());
    }*/
}

void sendMessage(ledDescription& led, bool state) {
    /*char dataMsg[100];
    String stateString = state ? "Включение" : "Выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "Прожектор %s в %s", led.name.c_str(), String(p).c_str());
    free(p);
    data.fcm.setNotifyMessage(stateString, dataMsg);

    if (Firebase.broadcastMessage(data)) {
        Serial.printf_P(PSTR("Сообщение отправлено\n"));
    } else {
        Serial.printf_P(PSTR("Ошибка отправки сообщения: %s\n"), data.errorReason().c_str());
    }*/
}

void clearAlarms() {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    for (size_t i = 0; i < ledsCount; i++) {
        Alarm.disable(leds[i].led.off);
        Alarm.disable(leds[i].led.on);
        Alarm.free(leds[i].led.off);
        Alarm.free(leds[i].led.on);
    }
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    for (size_t i = 0; i < dosersCount; i++) {
        Alarm.disable(dosers[i].alarm);
        Alarm.free(dosers[i].alarm);
    }
}

void uptime() {
    Serial.printf_P(PSTR("Время работы устройства: %s\n"), uptime_formatter::getUptime().c_str());
    if (!Firebase.setString(data, pathToUptime, uptime_formatter::getUptime())) {
        Serial.printf_P(PSTR("\nОшибка uptime: %s\n"), data.errorReason().c_str());
    };
}

void initRTC() {
    clockRTC.begin();
    char* p = clockRTC.dateFormat("H:i:s Y-m-d", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Время: %s\n"), String(p).c_str());
    free(p);
}
/*
void eeprom_test() {
#ifdef ARDUINO_ARCH_ESP8266
    Wire.begin();  // D3 and D4 on ESP8266
#else
    Wire.begin();
#endif

#ifdef ARDUINO_ARCH_AVR
    int inttmp = 32123;
#else
    // too logng for AVR 16 bits!
    int inttmp = 24543557;
#endif
    float floattmp = 2.4687;
    char chartmp = 'A';

    char string[17] = "ForoElectro.Net\0";

    // Testing template
    if (!eeprom.eeprom_write(0, inttmp)) {
        Serial.println("Failed to store INT");
    } else {
        Serial.println("INT correctly stored");
    }
      if (!eeprom.eeprom_write(4, floattmp)) {
          Serial.println("Failed to store FLOAT");
      } else {
          Serial.println("FLOAT correctly stored");
      }
      if (!eeprom.eeprom_write(8, chartmp)) {
          Serial.println("Failed to store CHAR");
      } else {
          Serial.println("CHAR correctly stored");
      }

      if (!eeprom.eeprom_write(9, (byte*)&string[0], 16)) {
          Serial.println("Failed to store STRING");
      } else {
          Serial.println("STRING correctly stored");
      }

      inttmp = 0;
      floattmp = 0;
      chartmp = 0;
      string[0] = string[1] = string[2] = string[3] = string[4] = 0;

      Serial.print("int: ");
      eeprom.eeprom_read(0, &inttmp);
      Serial.println(inttmp);

      Serial.print("float: ");
      eeprom.eeprom_read(4, &floattmp);
      Serial.println((float)floattmp);

      Serial.print("char: ");
      eeprom.eeprom_read(8, &chartmp);
      Serial.println(chartmp);

      Serial.print("chararray: ");
      eeprom.eeprom_read(9, (byte*)&string[0], 16);
      Serial.println(string);

      Serial.println();

      for (pos = 26; pos < 1000; pos++) {
          eeprom.eeprom_write(pos, (unsigned char)(pos % 256));
      }

      pos = 0;

}
*/

void sendNTPpacket(const IPAddress& address) {
    memset(packetBuffer, 0, NTP_PACKET_SIZE);
    packetBuffer[0] = 0b11100011;
    packetBuffer[1] = 0;
    packetBuffer[2] = 6;
    packetBuffer[3] = 0xEC;
    packetBuffer[12] = 49;
    packetBuffer[13] = 0x4E;
    packetBuffer[14] = 49;
    packetBuffer[15] = 52;

    udp.beginPacket(address, 123);
    udp.write(packetBuffer, NTP_PACKET_SIZE);
    udp.endPacket();
}

void syncTime() {
    Serial.printf_P(PSTR("Синхронизация времени\n"), ntpServerName);
    udp.begin(2390);
    WiFi.hostByName(ntpServerName, timeServerIP);
    sendNTPpacket(timeServerIP);
    delay(1000);
    int cb = udp.parsePacket();
    if (!cb) {
        Serial.printf_P(PSTR("Нет ответа от сервера времени %s\n"), ntpServerName);
        update_status = false;
        count_sync++;
        minute_sync = rtc.getEpoch();
    } else {
        update_status = true;
        count_sync = 0;
        hour_sync = rtc.getEpoch();
        Serial.printf_P(PSTR("Получен ответ от сервера времени %s\n"), ntpServerName);
        udp.read(packetBuffer, NTP_PACKET_SIZE);
        unsigned long highWord = word(packetBuffer[40], packetBuffer[41]);
        unsigned long lowWord = word(packetBuffer[42], packetBuffer[43]);
        unsigned long secsSince1900 = highWord << 16 | lowWord;
        const unsigned long seventyYears = 2208988800UL;
        unsigned long epoch = secsSince1900 - seventyYears;
        // 2 секунды разница с большим братом
        epoch = epoch + 2 + 10800;
        hour1 = (epoch % 86400L) / 3600;
        minute1 = (epoch % 3600) / 60;
        second1 = epoch % 60;

        char str[20];
        rtc.dateTimeToStr(str);
        Serial.printf_P(PSTR("%s\n"), str);
        uint32_t rtcEpoch = rtc.getEpoch();
        Serial.printf_P(PSTR("RTC: %d\n"), rtcEpoch);
        Serial.printf_P(PSTR("NTP: %d\n"), epoch);

        if (abs(rtcEpoch - epoch) > 2) {
            Serial.printf_P(PSTR("%s"), "Обновляем RTC (разница между эпохами = ");
            if ((rtcEpoch - epoch) > 10000) {
                Serial.printf_P(PSTR("%s\n"), abs(epoch - rtcEpoch));
            } else {
                Serial.printf_P(PSTR("%s\n"), abs(rtcEpoch - epoch));
            }
            rtc.setEpoch(epoch);
        } else {
            Serial.printf_P(PSTR("%s\n"), "Дата и время RTC не требуют синхронизации");
        }
    }
}

