Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void setCurrentState(boolean state, const String& name) {
    String stateString = state ? "ON" : "OFF";
    if (name == "Аэратор") {
        //"on=13:22#off=23:54#e=1#s=1#p=12"
        char buff[50];
        snprintf(buff, sizeof(buff), "on=%02d:%02d#off=%02d:%02d#e=%d#s=%d#p=%d", air.led.HOn, air.led.MOn, air.led.HOff,
                 air.led.MOff, air.led.enabled, state, air.led.pin);
        std::string buffAsStdStr = buff;
    } else {
        if (!Firebase.setBool(data, pathLight + name + "/state", state)) {
            Serial.printf_P(PSTR("Не удалось установить состояние прожектора %s в %s\n"), name.c_str(), stateString.c_str());
        } else {
            Serial.printf_P(PSTR("Состояние прожектора %s установлено в %s\n"), name.c_str(), stateString.c_str());
        }
    }
}

void doserHandler(const doser& dos) {
    switch (dos.type) {
        case K:
            doserK->begin();
            doserK->setEnableActiveState(LOW);
            doserK->move(dos.steps);
            doserK->setEnableActiveState(HIGH);
            break;
        case NP:
            doserNP->begin();
            doserNP->setEnableActiveState(LOW);
            doserNP->move(dos.steps);
            doserNP->setEnableActiveState(HIGH);
            break;
        case Fe:
            doserFe->begin();
            doserFe->setEnableActiveState(LOW);
            doserFe->move(dos.steps);
            doserFe->setEnableActiveState(HIGH);
            break;
        default:
            break;
    }
}

void ledOnHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Включение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, HIGH);
        sendMessage(led, true);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = true;

        ledState_t state;
        state.name = led.name;
        state.state = true;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void ledOffHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Выключение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, LOW);
        sendMessage(led, false);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = false;

        ledState_t state;
        state.name = led.name;
        state.state = false;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}
void parseJSON(const String& payload, ledDescription_t& led_) {
    DynamicJsonDocument doc(1500);
    DeserializationError err = deserializeJson(doc, payload);
    if (err) {
        Serial.print(F("deserializeJson() returned "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        Serial.println(array);
        std::vector<String> vectorString;
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            const char* name = obj["name"];
            const char* off = obj["off"];
            const char* on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            Serial.println("----------------------");
            Serial.printf_P(PSTR("enabled=%s name=%s off=%s on=%s pin=%s state=%s\n"), enabled, name, off, on, pin, state);
            led_.led.enabled = obj["enabled"];
            led_.led.pin = obj["pin"];
            led_.led.currentState = obj["state"];

            vectorString.clear();
            vectorString = splitVector(obj["off"], ':');
            led_.led.HOff = vectorString[0].toInt();
            led_.led.MOff = vectorString[1].toInt();

            vectorString.clear();
            vectorString = splitVector(obj["on"], ':');
            led_.led.HOn = vectorString[0].toInt();
            led_.led.MOn = vectorString[1].toInt();

            led_.led.off = Alarm.alarmRepeat(led_.led.HOff, led_.led.MOff, 0, ledOffHandler, led_);
            led_.led.on = Alarm.alarmRepeat(led_.led.HOn, led_.led.MOn, 0, ledOnHandler, led_);

            uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
            uint16_t minutesOn = led_.led.HOn * 60 + led_.led.MOn;
            uint16_t minutesOff = led_.led.HOff * 60 + led_.led.MOff;
            if ((minutes > minutesOn) && (minutes < minutesOff)) {
                ledOnHandler(led_);
            } else {
                ledOffHandler(led_);
            }
        }
        doc.shrinkToFit();
        doc.clear();
    }
}
void airOnHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Включение аэратора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, HIGH);
        sendMessage(led, true);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = true;

        ledState_t state;
        state.name = led.name;
        state.state = true;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Аэратор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void airOffHandler(ledDescription& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("Выключение аэратора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(indexRegisterRelay, led.led.pin, LOW);
        sendMessage(led, false);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);

        led.led.currentState = false;

        ledState_t state;
        state.name = led.name;
        state.state = false;
        vectorState.push_back(state);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Аэратор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void printLEDTime(ledPosition position) {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    uint8_t index;
    bool found = false;
    for (size_t i = 0; i < ledsCount; i++) {
        if (leds[i].position == position) {
            index = i;
            i = ledsCount;
            found = true;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не найден!!!");
    } else {
        Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"), leds[index].led.HOn,
                        leds[index].led.MOn, leds[index].led.HOff, leds[index].led.MOff,
                        ((leds[index].led.currentState == true) ? "включен" : "выключен"),
                        ((leds[index].led.enabled == true) ? "да" : "нет"), leds[index].led.pin

