Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        );
    }
}

void printAllLedsTime() {
    Serial.printf_P(PSTR("%s\n"), "Настройки прожекторов");
    for (ledPosition i : ledPositionIterator()) {
        printLEDTime(i);
    }
}

void printDoser(doserType dosertype) {
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    uint8_t index;
    bool found = false;
    for (size_t i = 0; i < dosersCount; i++) {
        if (dosers[i].type == dosertype) {
            index = i;
            i = dosersCount;
            found = true;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s\n"), "Дозатор не найден!!!");
    } else {
        Serial.printf_P(
            PSTR("%d => %s: Вкл %02d:%02d. Pins: dir=%d step=%d enable=%d sleep=%d.\nОбъём: %d. Modes:%d.%d.%d Steps:%d\n"),
            dosers[index].index, dosers[index].name.c_str(), dosers[index].hour, dosers[index].minute, dosers[index].dirPin,
            dosers[index].stepPin, dosers[index].enablePin, dosers[index].sleepPin, dosers[index].volume, dosers[index].mode0_pin,
            dosers[index].mode1_pin, dosers[index].mode2_pin, dosers[index].steps);
    }
}

void printAllDosers() {
    Serial.printf_P(PSTR("%s\n"), "Настройки дозаторов");
    for (doserType i : doserTypeIterator()) {
        printDoser(i);
    }
}

void printAir() {
    Serial.printf_P(PSTR("%s\n"), "Настройки аэратора");
    Serial.printf_P(PSTR(" Вкл-%02d:%02d. Выкл-%02d:%02d. Состояние: %s. Разрешен: %s. PIN: %d\n"), air.led.HOn, air.led.MOn,
                    air.led.HOff, air.led.MOff, ((air.led.currentState == true) ? "включен" : "выключен"),
                    ((air.led.enabled == true) ? "да" : "нет"), air.led.pin

    );
}

void setDoser(doserType dosertype) {
    std::unique_ptr<GBasic> doser{};
    uint8_t dosersCount = (sizeof(dosers) / sizeof(*dosers));
    String name;
    uint8_t i = 0;
    bool found = false;
    for (size_t k = 0; k < dosersCount; k++) {
        if (dosers[k].type == dosertype) {
            name = dosers[k].name;
            i = k;
            found = true;
            k = dosersCount;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s %s %s\n"), "Дозатор", name.c_str(), "не найден");
    } else {
        if (!Firebase.getString(data, pathDoser + name)) {
            Serial.printf_P(PSTR("%s %s: %s\n"), "Ошибка загрузки параметров дозатора", name.c_str(), data.errorReason().c_str());
        } else {
            if ((data.dataType() == "string")) {
                String payload = data.stringData();
                //"d=1#s=1#e=2#sl=2#ss=200#0=1#1=2#2=4#i=3#t=23:59"
                std::vector<String> vectorPayload = splitVector(payload, '#');

                for (String pair : vectorPayload) {
                    std::vector<String> pairItem = splitVector(pair, '=');
                    if (pairItem[0] == "d") {
                        dosers[i].dirPin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "s") {
                        dosers[i].stepPin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "e") {
                        dosers[i].enablePin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "sl") {
                        dosers[i].sleepPin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "ss") {
                        dosers[i].steps = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "0") {
                        dosers[i].mode0_pin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "1") {
                        dosers[i].mode1_pin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "2") {
                        dosers[i].mode2_pin = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "i") {
                        dosers[i].index = pairItem[1].toInt();
                    }
                    if (pairItem[0] == "t") {
                        std::vector<String> timeVector = splitVector(pairItem[1], ':');
                        dosers[i].hour = timeVector[0].toInt();
                        dosers[i].minute = timeVector[1].toInt();
                        timeVector.clear();
                    }
                    pairItem.clear();
                }
                vectorPayload.clear();
                doser = std::make_unique<GBasic>(dosers[i].steps, dosers[i].dirPin, dosers[i].stepPin, dosers[i].enablePin,
                                                 dosers[i].mode0_pin, dosers[i].mode1_pin, dosers[i].mode2_pin, shiftRegister,
                                                 dosers[i].index);
                switch (dosertype) {
                    case K:
                        doserK = std::move(doser);
                        break;
                    case NP:
                        doserNP = std::move(doser);
                        break;
                    case Fe:
                        doserFe = std::move(doser);
                        break;
                    default:
                        Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора", ToString(dosertype));
                        break;
                }
                dosers[i].alarm = Alarm.alarmRepeat(dosers[i].hour, dosers[i].minute, 0, doserHandler, dosers[i]);
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не String");
            }
        }
    }
}

void setLEDTimeBEL(ledPosition position) {
    uint8_t ledsCount = (sizeof(leds) / sizeof(*leds));
    String ledPath;
    uint8_t i;
    bool found = false;
    for (size_t k = 0; k < ledsCount; k++) {
        if (leds[k].position == position) {
            ledPath = leds[k].name;
            i = k;
            found = true;
            k = ledsCount;
        }
    }
    if (found) {
        char tempBuffer[100];
        char* _tab = nullptr;
        _tab = _getPGMString(backEndLessStrings[0]);
        strcpy_P(tempBuffer, _getPGMString(backEndLessStrings[0]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[5]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[1]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[5]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[2]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[5]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[17]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[5]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[8]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[6]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[3]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[9]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[7]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[3]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[10]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[7]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[3]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[11]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[7]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[3]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[12]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[7]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[3]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[13]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[7]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[3]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[14]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[7]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[15]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[10]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[4]));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[16]));
        // TODO Сейчас только один прожектор
        strcat_P(tempBuffer, _getPGMString(led_0));
        strcat_P(tempBuffer, _getPGMString(backEndLessStrings[16]));
        Serial.printf_P(tempBuffer);
        Serial.printf_P(PSTR("%s\n"), "[HTTPS] begin...");
        // sprintf_P(tempBuffer, PSTR("%s\n"), "[HTTPS] begin...");
        // Serial.printf_P(PSTR("%s\n"), _getPGMString(string_table[2]));
        // Serial.print(F("Write something on the Serial Monitor that is stored in FLASH"));
        // char buffer1[30];
        // strcpy_P(buffer1, (char*)pgm_read_word(&(string_table[3])));

        if (https.begin(*client, tempBuffer)) {
            Serial.print("[HTTPS] GET...\n");
            int httpCode = https.GET();
            if (httpCode > 0) {
                Serial.printf_P(PSTR("[HTTP] GET... code: %d\n"), httpCode);
                if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                    parseJSON(https.getString(), leds[i]);
                }
            } else {
                Serial.printf_P(PSTR("[HTTP] GET... failed, error: %s\n"), https.errorToString(httpCode).c_str());
            }
            https.end();
        } else {
            Serial.printf_P(PSTR("%s\n"), "Unable to connect\n");
        }
        _delPtr(_tab);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не найден");
    }
}

void setLEDTime(ledPosition position) {
    uint8_t ledsCount = (sizeof(leds) / sizeof(*leds));
    String ledPath;
    uint8_t i;
    bool found = false;
    for (size_t k = 0; k < ledsCount; k++) {
        if (leds[k].position == position) {
            ledPath = leds[k].name;
            i = k;
            found = true;
            k = ledsCount;
        }
    }
    if (found) {
        if (Firebase.getJSON(data, pathLight + ledPath)) {
            if ((data.dataType() == "json")) {
                String json = data.jsonString();
                StaticJsonDocument<180> doc;
                std::vector<String> vectorString;
                DeserializationError err = deserializeJson(doc, json);
                if (err) {
                    Serial.printf_P(PSTR("Ошибка десериализации: %s\n"), err.c_str());
                } else {
                    leds[i].led.enabled = doc["enabled"];
                    leds[i].led.pin = doc["pin"];
                    leds[i].led.currentState = doc["state"];

