Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
                    vectorString.clear();
                    vectorString = splitVector(doc["off"], ':');
                    leds[i].led.HOff = vectorString[0].toInt();
                    leds[i].led.MOff = vectorString[1].toInt();

                    vectorString.clear();
                    vectorString = splitVector(doc["on"], ':');
                    leds[i].led.HOn = vectorString[0].toInt();
                    leds[i].led.MOn = vectorString[1].toInt();

                    leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
                    leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

                    uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
                    uint16_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
                    uint16_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
                    if ((minutes > minutesOn) && (minutes < minutesOff)) {
                        ledOnHandler(leds[i]);
                    } else {
                        ledOffHandler(leds[i]);
                    }
                    doc.clear();
                }
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не является JSON объектом");
            }
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка загрузки параметров прожектора", data.errorReason().c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не найден");
    }
}

uint16_t airAddress() {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    return StartAddress + dosersCount + ledsCount + sizeof(ledDescription) + 1;
}

void writeEEPROMAir() {
    if (eeprom.eeprom_write(airAddress(), air)) {
        Serial.printf_P(PSTR(" Параметры по аэратору сохранены в EEPROM\n"));
    } else {
        Serial.printf_P(PSTR(" Ошибка сохранения параметров аэратора в EEPROM\n"));
    }
}

uint16_t doserAddress(const uint8_t num) {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    return StartAddress + num * sizeof(doser) + ledsCount * sizeof(ledDescription) + 1;
}

void writeEEPROMDoser() {
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    for (size_t i = 0; i < dosersCount; i++) {
        if (eeprom.eeprom_write(doserAddress(i), dosers[i])) {
            Serial.printf_P(PSTR(" Параметры по дозатору %s сохранены в EEPROM\n"), dosers[i].name.c_str());
        } else {
            Serial.printf_P(PSTR(" Ошибка сохранения параметров дозатора %s в EEPROM\n"), dosers[i].name.c_str());
        }
    }
}

uint16_t ledAddress(const uint8_t num) {
    return StartAddress + num * sizeof(ledDescription);
}

void writeEEPROMLed() {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    for (size_t i = 0; i < ledsCount; i++) {
        if (eeprom.eeprom_write(ledAddress(i), leds[i])) {
            Serial.printf_P(PSTR(" Параметры по прожектору %s сохранены в EEPROM\n"), leds[i].name.c_str());
        } else {
            Serial.printf_P(PSTR(" Ошибка сохранения параметров прожектора %s в EEPROM\n"), leds[i].name.c_str());
        }
    }
}

void readOptionsEEPROM() {
    ledDescription_t ledFromEEPROM;
    doser doserFromEEPROM;
    ledDescription_t airFromEEPROM;
    Serial.printf_P(PSTR("%s\n"), "Загрузка настроек из EEPROM");
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    for (size_t i = 0; i < ledsCount; i++) {
        eeprom.eeprom_read(ledAddress(i), &ledFromEEPROM);
        leds[i] = ledFromEEPROM;
        leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
        leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

        uint8_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
        uint8_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
        uint8_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
        if ((minutes > minutesOn) && (minutes < minutesOff)) {
            ledOnHandler(leds[i]);
        } else {
            ledOffHandler(leds[i]);
        }
    }
    for (size_t i = 0; i < dosersCount; i++) {
        eeprom.eeprom_read(doserAddress(i), &doserFromEEPROM);
        dosers[i] = doserFromEEPROM;
        dosers[i].alarm = Alarm.alarmRepeat(dosers[i].hour, dosers[i].minute, 0, doserHandler, dosers[i]);
    }

    // Air
    eeprom.eeprom_read(airAddress(), &airFromEEPROM);
    air = airFromEEPROM;
    air.led.on = Alarm.alarmRepeat(air.led.HOn, air.led.MOn, 0, airOnHandler, air);
    air.led.off = Alarm.alarmRepeat(air.led.HOff, air.led.MOff, 0, airOffHandler, air);

    printAllLedsTime();
    printAllDosers();
    printAir();
}

void setAir() {
    if (!Firebase.getString(data, pathAir)) {
        Serial.printf_P(PSTR("%s: %s\n"), "Ошибка загрузки параметров аэратора", data.errorReason().c_str());
    } else {
        if ((data.dataType() == "string")) {
            String payload = data.stringData();
            //"on=13:22#off=23:54#e=1#s=1#p=12"
            std::vector<String> vectorPayload = splitVector(payload, '#');
            std::vector<String> timeVector;
            for (String pair : vectorPayload) {
                std::vector<String> pairItem = splitVector(pair, '=');
                if (pairItem[0] == "on") {
                    timeVector = splitVector(pairItem[1], ':');
                    air.led.HOn = timeVector[0].toInt();
                    air.led.MOn = timeVector[1].toInt();
                    timeVector.clear();
                }
                if (pairItem[0] == "off") {
                    timeVector = splitVector(pairItem[1], ':');
                    air.led.HOff = timeVector[0].toInt();
                    air.led.MOff = timeVector[1].toInt();
                    timeVector.clear();
                }
                if (pairItem[0] == "e") {
                    air.led.enabled = pairItem[1].toInt();
                }
                if (pairItem[0] == "s") {
                    air.led.currentState = pairItem[1].toInt();
                }
                if (pairItem[0] == "p") {
                    air.led.pin = pairItem[1].toInt();
                }
                pairItem.clear();
            }
            vectorPayload.clear();

            air.led.on = Alarm.alarmRepeat(air.led.HOn, air.led.MOn, 0, airOnHandler, air);
            air.led.off = Alarm.alarmRepeat(air.led.HOff, air.led.MOff, 0, airOffHandler, air);

            uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
            uint16_t minutesOn = air.led.HOn * 60 + air.led.MOn;
            uint16_t minutesOff = air.led.HOff * 60 + air.led.MOff;
            if ((minutes > minutesOn) && (minutes < minutesOff)) {
                airOnHandler(air);
            } else {
                airOffHandler(air);
            }
        } else {
            Serial.printf_P(PSTR("%s\n"), "Ответ не String");
        }
    }
}
void readOptionsBEL() {
    Serial.printf_P(PSTR("%s\n"), "Загрузка из BackendLess");

    Serial.printf_P(PSTR("%s\n"), "Прожекторы...");
    for (ledPosition i : ledPositionIterator()) {
        setLEDTimeBEL(i);
    }
}
void readOptionsFirebase() {
    Serial.printf_P(PSTR("%s\n"), "Загрузка из Firebase");

    Serial.printf_P(PSTR("%s\n"), "Прожекторы...");
    for (ledPosition i : ledPositionIterator()) {
        setLEDTime(i);
    }

    Serial.printf_P(PSTR("%s\n"), "Дозаторы...");
    for (doserType i : doserTypeIterator()) {
        setDoser(i);
    }

