Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
    setAir();

    Serial.printf_P(PSTR("%s\n"), "Запись в EEPROM");
    writeEEPROMLed();
    writeEEPROMDoser();
    writeEEPROMAir();
}

double floatToDouble(float x) {
    return static_cast<double>(x);
}

void writeTemperatureFirebase() {
    if (!WiFi.isConnected())
        return;

    char* p1 = clockRTC.dateFormat("Y-m-d", clockRTC.getDateTime());
    String deviceDateKey = p1;
    free(p1);

    FirebaseJson jsonOnline, jsonHistory;
    char* p2 = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    jsonOnline.add("DateTime", String(p2));
    jsonOnline.add("temp1", floatToDouble(temp1));
    jsonOnline.add("temp2", floatToDouble(temp2));
    free(p2);
    char* p3 = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    jsonHistory.add("DateTime", String(p3));
    jsonHistory.add("temp1", floatToDouble(temp1));
    jsonHistory.add("temp2", floatToDouble(temp2));
    free(p3);
    Serial.printf_P(PSTR("%s"), "Отправляем температуру в ветку Online -> ");
    if (Firebase.setJSON(data, pathTemperatureOnline, jsonOnline)) {
        Serial.printf_P(PSTR("%s\n"), "OK");
    } else {
        Serial.printf_P(PSTR("Ошибка: %s\n"), data.errorReason().c_str());
    }
    jsonOnline.clear();

    Serial.printf_P(PSTR("%s"), "Отправляем температуру в ветку History -> ");
    if (Firebase.pushJSON(data, pathTemperatureHistory + deviceDateKey, jsonHistory)) {
        Serial.printf_P(PSTR("%s\n"), "OK");
    } else {
        Serial.printf_P(PSTR("Ошибка: %s\n"), data.errorReason().c_str());
    }
    jsonHistory.clear();
}

void writeBootHistory() {
    char* p = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    if (Firebase.pushString(data, pathToBootHistory, String(p))) {
        Serial.printf_P(PSTR("%s\n"), "Запись времени старта");
    } else {
        Serial.printf_P(PSTR("\n%s %s\n"), "Ошибка записи времени старта:", data.errorReason().c_str());
    }
    free(p);
}

void setClock() {
    configTime(3 * 3600, 0, "pool.ntp.org", "time.nist.gov");
    time_t now = time(nullptr);
    uint8_t tryCount = 0;
    while (now < 8 * 3600 * 2) {
        delay(100);
        now = time(nullptr);
        tryCount++;
        if (tryCount > 50)
            break;
    }
    struct tm timeinfo;
    gmtime_r(&now, &timeinfo);
}

void lastOnline() {
    char* p = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    Firebase.setString(data, pathToLastOnline, String(p));
    free(p);
}

void Timer5Min() {
    uptime();
    lastOnline();
    getTemperature();
    writeTemperatureFirebase();
}

void printAll() {
    printAllLedsTime();
    printAllDosers();
    printAir();
}

void Timer1Min() {
    ledState_t currentLed;
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("%s "), String(p).c_str());
    free(p);
    getTemperature();
    checkUpdateSettings();
    if (shouldUpdateFlag) {
        readOptionsFirebase();
        printAll();
        shouldUpdateFlag = false;
    }
    while (!vectorState.empty()) {
        currentLed = vectorState.back();
        setCurrentState(currentLed.state, currentLed.name);
        vectorState.pop_back();
    }
    vectorState.clear();
}

void startMainTimers() {
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные", Alarm.count());
    Alarm.timerRepeat(5 * 60, Timer5Min);  // сохраняем температуру в Firebase/EEPROM
    Alarm.timerRepeat(60, Timer1Min);      // вывод uptime и тмемпературу каждую минуту
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные и прожекторные", Alarm.count());
}

void checkUpdateSettings() {
    if (Firebase.getBool(data, pathUpdateSettings)) {
        if (data.dataType() == "boolean") {
            if (data.boolData()) {
                Serial.printf_P(PSTR("%s\n"), "Запрос на обновление всех настроек");
                shouldUpdateFlag = true;
                clearAlarms();
                if (!Firebase.setBool(data, pathUpdateSettings, false)) {
                    Serial.printf_P(PSTR("%s: %s\n"), "Не удалось отключить флаг сброса настроек", data.errorReason().c_str());
                }
            }
        } else {
            Serial.printf_P(PSTR("%s\n"), "Флаг сброса настроек UpdateSettings должен быть типа boolean");
        }
    } else {
        Serial.printf_P(PSTR("Ошибка чтения флага сброса настроек UpdateSettings: %s\n"), data.errorReason().c_str());
    }
}

void initArrays() {
    initRTC();
    initLeds();
    initDosers();
    initAir();
}

void setup() {
    Serial.begin(115200);
    Serial.println();

    client->setInsecure();

    initArrays();
    getTemperature();

    Serial.printf_P(PSTR("%s: %s\n"), "Подключение к WiFi", WIFI_SSID);
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    WiFi.setAutoReconnect(true);
    while ((WiFi.status() != WL_CONNECTED) && (wifiConnectCount != wifiMaxTry)) {
        Serial.printf_P(PSTR("%s"), ".");
        delay(500);
        wifiConnectCount++;
    }

    if (WiFi.status() != WL_CONNECTED) {
        wifiConnectCount = 0;
        Serial.printf_P(PSTR("%s: %s\n"), "Не удалось подключиться к WiFi", WIFI_SSID);
        readOptionsEEPROM();
    } else {
        Serial.printf_P(PSTR("\n%s: %s IP: %s\n"), "Успешное подключение к WiFi", WIFI_SSID, WiFi.localIP().toString().c_str());
        WiFi.hostname(WiFi_hostname);
        setClock();
        Firebase.begin(FIREBASE_HOST, FIREBASE_AUTH);
        Firebase.reconnectWiFi(true);

        data.fcm.begin(FIREBASE_FCM_SERVER_KEY);
        data.fcm.addDeviceToken(FIREBASE_FCM_DEVICE_TOKEN);
        data.fcm.setPriority("high");
        data.fcm.setTimeToLive(1000);

        sendMessage();
        writeBootHistory();
        syncTime();
        // readOptionsFirebase();
        readOptionsBEL();
        // printAll();
    }
    // startMainTimers();
    // Timer5Min();
}

void prWiFiStatus(int s) {
#define VALCASE(x)                    \
    case x:                           \
        Serial.print("WiFi.status "); \
        Serial.println(#x);           \
        break;

    switch (s) {
        VALCASE(WL_NO_SHIELD);
        VALCASE(WL_IDLE_STATUS);
        VALCASE(WL_NO_SSID_AVAIL);
        VALCASE(WL_SCAN_COMPLETED);
        VALCASE(WL_CONNECTED);
        VALCASE(WL_CONNECT_FAILED);
        VALCASE(WL_CONNECTION_LOST);
        VALCASE(WL_DISCONNECTED);
        default:
            Serial.println(s);
            break;
    }
}

void loop() {
    Alarm.delay(10);
    currentMillis = millis();

    if (currentMillis - previousMillis > 60000UL) {
        previousMillis = currentMillis;
        // prWiFiStatus(WiFi.status());
    }
}
